[
  {
    "path": "posts/2022-09-14-final-project-for-stat-302-data-visualization/",
    "title": "Final Project for STAT 302: Data Visualization",
    "description": "For my final project, I cleaned and analyzed the \"All Playstation 4 Games\" dataset.",
    "author": [
      {
        "name": "Amber Chiodini",
        "url": {}
      }
    ],
    "date": "2022-09-14",
    "categories": [],
    "contents": "\r\nIntroduction\r\nThe Playstation 4 (PS4) is a home video game console that was developed by Sony Computer Entertainment. It is the successor to the PS3 and launched on November 15th, 2013 in North America. The following dataset contains a wide-range of information such as the names of the games along with their publishers and developers.\r\nObjective\r\nI chose this dataset because the PS4, which has been available to the public for almost a decade, has led to the production of many award-winning games such as “God of War (2018)”, “Spider-Man (2018)” and “Horizon Zero Dawn (2017)”.\r\nThe goal of this project is to analyze the “All Playstation 4 Games” dataset and answer the following three questions:\r\nWhich year were the most games released?\r\nWhat is the relationship between average completion time and games?\r\nWho are the most popular publishers and developers & how many action games did they produce?\r\nCitation\r\nShivam, B. (2022). All Playstation 4 Games, Version 1. Retrieved August 21, 2022 from https://www.kaggle.com/datasets/shivamb/all-playstation-4-games.\r\nGraphic 1\r\n\r\nGraphic 2\r\n\r\nGraphic 3\r\n\r\nWhat do the visualizations communicate?\r\nThese graphics help to communicate the dataset, such as the amount of games that were released each year, their average completion time, and the top ten most popular developers and publishers.\r\nHowever, some graphics do not translate the data well, which can bring limitations to the story-telling. Therefore, the bar charts were used because they emphasized the dramatic differences between different variables (e.g. developers, publishers, games).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-09-14T15:00:53-05:00",
    "input_file": {}
  }
]
